/*
 * Этот триггер срабатыват при занесении данных в таблицу с содержимым заказов orderslist
 * После получения информации о заказе, обновляется столбец зарезервированного
 * товара в таблице доступного товара на складах availability
 */
DROP TRIGGER IF EXISTS reserved_items;

DELIMITER //

CREATE TRIGGER reserved_items AFTER INSERT ON orderslist
FOR EACH ROW 
BEGIN 
	UPDATE availability 
		SET reserved = reserved + NEW.num
		WHERE id_item = NEW.item_id;
END //

DELIMITER ;

-- Проверка одним значением
INSERT INTO orderslist VALUES
	(2, 4, 12);
-- Проверка пакетом	
INSERT INTO orderslist VALUES 
(3,9,23),(2,1,22),(4,5,13),(6,10,7),(8,5,50),(6,8,32),(10,3,22),(8,10,11),
(10,7,24),(7,1,16),(4,9,7),(3,9,40),(6,8,46),(8,2,19),(9,9,21),(4,8,28),(4,8,50),
(1,5,3),(1,7,22),(4,3,5),(9,2,1),(4,7,2),(2,1,12),(1,4,40),(7,5,35),(10,9,33),
(7,2,21),(6,4,38),(10,7,32),(3,10,17),(9,4,40),(6,8,38),(7,3,21),(5,3,9),
(10,7,25),(2,8,32),(9,3,32),(1,3,20),(7,6,14),(8,2,46),(3,1,25),(5,5,18),
(9,10,8),(6,4,46),(5,4,24),(8,6,48),(4,7,45),(10,10,24),(7,5,17),(5,9,36);

